{"title": "Over 40 Indians feared dead in Saudi: Medina-bound bus collides with diesel tanker", "text": "More than 40 Indian Umrah pilgrims, many from Hyderabad, are feared dead after a bus collided with a diesel tanker in Saudi Arabia early Monday. The bus was travelling from Mecca to Medina when the crash occurred. 24x7 helpline.Helpline (toll free): 8002440003 (Toll free), 0122614093, 0126614276, 0556122301 (WhatsApp)", "url": "https://timesofindia.indiatimes.com/india/over-40-indians-feared-dead-in-saudi-arabia-mecca-bound-bus-collides-with-diesel-tanker-majority-pilgrims-from-hyderabad/articleshow/125376587.cms"}
{"title": "Lalu pari-war: After Rohini, 3 more daughters walk out of Patna home", "text": "A bitter family feud has erupted within Lalu Prasad's family, with daughter Rohini Acharya alleging humiliation and abuse from her brother Tejashwi Yadav and his associates after donating a kidney to her father. The fallout intensified as three more sisters left their parents' home, while Tej Pratap Yadav voiced support for Rohini, accusing 'betrayers' of targeting the family.", "url": "https://timesofindia.indiatimes.com/india/lalu-pari-war-after-rohini-3-more-daughters-walk-out-of-patna-home/articleshow/125373566.cms"}
{"title": "Delhi records best November 1–15 air quality in 3 years — still not worth inhaling", "text": "Delhi experienced its lowest average AQI in three years during the first fortnight of November, registering at 348. This improvement, despite remaining in the 'very poor' category, is attributed to an early Diwali, reduced stubble burning, better weather, and water sprinkling near monitoring stations.", "url": "https://timesofindia.indiatimes.com/city/delhi/delhi-records-best-november-115-air-quality-in-3-years-still-not-worth-inhaling/articleshow/125375629.cms"}
{"title": "French consulate staffer molested while walking home in Bandra", "text": "A 27-year-old French individual became the victim of an alarming molestation incident by a scooter rider on the streets of Bandra West. On November 8th, the unfortunate event spurred a police investigation that culminated in the arrest of 25-year-old Sunil Waghela, a trader from Dharavi.", "url": "https://timesofindia.indiatimes.com/city/mumbai/french-woman-molested-on-bandra-road-in-mumbai-scooterist-arrested-less-than-24-hours-after-consulate-filed-complaint/articleshow/125370524.cms"}
{"title": "From Gukesh to R Pragg: Early WC exits expose harsh truths", "text": "Russian Grandmaster Daniil Dubov's dismissive comments after defeating R Praggnanandhaa highlight a trend of early exits for elite players at the FIDE World Cup 2025. Several top seeds, including World Champion D Gukesh, fell to lower-rated opponents, prompting discussions about the narrowing gap in skill and flaws in the rating system.", "url": "https://timesofindia.indiatimes.com/sports/chess/from-d-gukesh-to-r-praggnanandhaa-is-everything-all-right-with-top-chess-players-early-world-cup-exits-expose-harsh-truth/articleshow/125375999.cms"}
{"title": "'Proudly called it home for 15 years': Google CEO on Texas journey", "text": "Google is investing a massive $40 billion in Texas by 2027. This significant commitment will build new cloud and AI infrastructure, including data centers in Armstrong and Haskell Counties. The company will also boost energy resilience and support thousands of new jobs. Google is also funding projects to train more electricians for the AI era.", "url": "https://timesofindia.indiatimes.com/technology/tech-news/weve-proudly-called-texas-home-for-15-years-says-google-ceo-sundar-pichai-announcing-40-billion-investment-in-texas/articleshow/125340570.cms"}
{"title": "Tamil Nadu CM MK Stalin, actor Ajith Kumar get bomb threat", "text": "", "url": "https://timesofindia.indiatimes.com/city/chennai/tamil-nadu-cm-mk-stalin-actor-ajith-kumar-gets-bomb-threat/articleshow/125375890.cms"}
{"title": "1,300 CCTVs, 10 frames: Suicide bomber’s drive route before Red Fort blast", "text": "Investigators meticulously mapped suicide bomber Umar Un Nabi's journey using over 1,300 CCTV cameras. His movements spanned Faridabad, Nuh, and Delhi. The white i20 was tracked through sensitive zones in the capital for hours before the explosion. This electronic route provides a detailed account of his activities.", "url": "https://timesofindia.indiatimes.com/city/delhi/inside-umars-electronic-route-delhi-suicide-bombers-13-day-path-mapped-via-1300-cctvs-passed-multiple-high-security-zones/articleshow/125374625.cms"}
{"title": "Watch: Volcano erupts multiple times in Japan's Kyushu", "text": "Sakurajima volcano in Japan erupted multiple times early Sunday, spewing ash up to 4,400 meters high and causing about 30 flight cancellations. While volcanic rocks landed nearby, no injuries or pyroclastic flows were reported. This marks the first eruption reaching 4 km or more in nearly 13 months, with the alert level remaining at three.", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/plume-of-ash-and-smoke-sakurajima-volcano-erupts-multiple-times-in-japans-kyushu-flights-disrupted/articleshow/125376000.cms"}
{"title": "Microsoft CEO dismisses Copilot worries; calls competition positive", "text": "Microsoft CEO Satya Nadella views increased competition in the AI coding assistant market as a positive sign of industry growth, not a threat.  Despite GitHub Copilot's market share decline, Nadella highlights the overall market expansion and GitHub's platform strategy, which benefits from increased developer activity regardless of the specific coding tool used.", "url": "https://timesofindia.indiatimes.com/technology/tech-news/microsoft-ceo-satya-nadella-on-when-he-is-told-claude-is-going-to-kill-microsoft-cursor-is-going-to-kill-microsoft-its-/articleshow/125359123.cms"}
{"title": "Farewell to Bollywood's 'He-Man': Esha Deol breaks down; Big B, Salman attend last rites", "text": "Bollywood icon Dharmendra passed away at his Mumbai residence on November 24. The legendary actor's cremation was conducted swiftly, with many industry colleagues and family members, including Hema Malini and the Deol family, in attendance to pay their final respects. Prime Minister Narendra Modi and President Droupadi Murmu mourned his passing, acknowledging his significant contributions to Indian cinema.", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/dharmendra-last-rites-esha-deol-breaks-into-tears-hema-malini-folds-hands-amitabh-bachchan-salman-khan-aamir-khan-and-other-celebs-leave-crematorium-after-paying-final-respects/articleshow/125538277.cms"}
{"title": "'You're Chinese': Indian harassed by Shanghai airport officials; told passport 'ínvalid'", "text": "An Indian national from Arunachal Pradesh faced an 18-hour ordeal at Shanghai Pudong Airport, with Chinese immigration officials deeming her passport invalid due to her birthplace. Prema Wangjom Thongdok, a UK resident, was allegedly told Arunachal is not part of India. The Indian embassy intervened, resolving the issue.", "url": "https://timesofindia.indiatimes.com/india/youre-chinese-arunachal-woman-harassed-by-shanghai-airport-officials-told-passport-nvalid/articleshow/125541240.cms"}
{"title": "Wedding postponed: Smriti removes marriage posts; father, fiancé hospitalised", "text": "Indian cricketer Smriti Mandhana has removed all wedding-related posts from her Instagram. This comes as her father, Shrinivas Mandhana, was hospitalised. The wedding ceremony, scheduled for November 23, has been indefinitely postponed. Her manager confirmed the postponement due to Mr Mandhana's health. The couple and families request privacy during this time.", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/wedding-postponed-smriti-mandhana-removes-marriage-posts-after-father-and-fianc-palash-muchhal-hospitalised/articleshow/125539513.cms"}
{"title": "BLO deaths: EC moves fast after audio surfaces of official; TMC sharpens attack", "text": "The Election Commission is addressing work-related stress among Booth Level Officers (BLOs) during Kerala's Special Intensive Revision of electoral rolls after an audio message went viral. This follows reports of BLO suicides and deaths due to excessive pressure in several states, prompting protests and criticism from political parties regarding the rushed and opaque nature of the revision process.", "url": "https://timesofindia.indiatimes.com/india/blo-deaths-ec-moves-fast-after-audio-surfaces-of-official-claiming-stress-tmc-sharpens-attack/articleshow/125541710.cms"}
{"title": "Microsoft CEO surprise pick: Turns to exec from past; once accused of ‘bombshell’ complaints", "text": "Microsoft CEO Satya Nadella has tasked strategist Rolf Harms with re-evaluating the company's business model for the AI era, drawing parallels to the cloud transformation 15 years ago. Harms, who previously guided Microsoft's cloud economics, will advise leadership on adapting AI infrastructure, platforms, and applications, aiming to navigate the economic challenges and opportunities of this new technological shift.", "url": "https://timesofindia.indiatimes.com/technology/tech-news/microsoft-ceo-satya-nadella-is-turning-to-an-executive-who-faced-employee-complaints-of-throwing-bombshells-into-their-organisation-15-years-ago/articleshow/125539855.cms"}
{"title": "Ethiopia volcano ash plumes: IndiGo flight to Abu Dhabi diverts to Ahmedabad", "text": "Ash plumes from Ethiopia's Hayli Gubbi volcano eruption are moving east. These plumes are expected to reach Delhi and Jaipur. Indian aviation authorities are monitoring the situation closely. Airlines are also watching for potential impacts on flight movements. The ash is currently drifting beyond Oman. Officials hope the intensity will reduce as it travels.", "url": "https://timesofindia.indiatimes.com/business/india-business/ethiopia-volcano-ash-plumes-indigo-flight-to-abu-dhabi-diverts-to-ahmedabad/articleshow/125538235.cms"}
{"title": "Virat Kohli mourns Dharmendra: 'Today, we have lost a legend'", "text": "Indian cricket stars, including Virat Kohli, Deepti Sharma, Virender Sehwag, Harbhajan Singh, Kedar Jadhav, and Shikhar Dhawan, have paid heartfelt tributes to legendary Bollywood actor Dharmendra, who passed away at 89. IPL teams also joined in mourning the iconic actor, remembering his charm, talent, and enduring legacy in Indian cinema.", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/virat-kohli-mourns-dharmendras-demise-today-we-have-lost-a-legend/articleshow/125541068.cms"}
{"title": "IND vs SA: Ashwin’s 'Mankad' reply for Marco Jansen goes viral", "text": "Ravichandran Ashwin humorously suggested it would be easy to 'Mankad' South Africa's Marco Jansen, while praising his talent. Jansen's impressive performance with both bat and ball in the ongoing Test match has put South Africa in a strong position to win the series. South Africa are closing on a first series win in India since Hansie Cronje's team triumphed in 2000.", "url": "https://timesofindia.indiatimes.com/sports/cricket/india-vs-south-africa/ind-vs-sa-ashwins-mankad-reply-for-marco-jansen-goes-viral/articleshow/125541652.cms"}
{"title": "Apple's warning to stores: Foreign SIM = penalty; outlets face closure risk", "text": "Apple distributors are warning Indian retailers against activating new iPhones, especially the iPhone 17 series, with foreign SIMs within 90 days, citing hefty penalties and store code blocking. This crackdown follows a surge in iPhone 17 models being diverted to high-margin markets like Russia, Africa, and the Middle East, causing domestic shortages. Retailers are pushing back against this mandate, arguing it unfairly targets them.", "url": "https://timesofindia.indiatimes.com/technology/tech-news/apple-distributors-have-a-warning-for-mobile-phone-stores-in-india-if-any-device-sold-from-your-outlet-is-found-to-be-/articleshow/125536233.cms"}
{"title": "'Does a lot of dishes': Usha Vance reacts to missing ring", "text": "Second Lady Usha Vance clarified speculation surrounding her marriage after being photographed without her wedding ring. A spokesperson attributed the oversight to her busy role as a mother of three, emphasizing no deeper meaning. This follows recent online scrutiny of Vice President JD Vance's interactions at a conservative event and his comments regarding his wife's religious beliefs.", "url": "https://timesofindia.indiatimes.com/world/us/missing-ring-chatter-usha-vance-reacts-to-divorce-speculation-spokesperson-issues-clarification/articleshow/125531458.cms"}
